-- 카테고리 추가
INSERT INTO
    category (name, parent_id, depth)
VALUES ('전자제품', NULL, 0),
    ('의류', NULL, 0),
    ('식품', NULL, 0),
    ('가구', NULL, 0),
    ('도서', NULL, 0),
    ('스마트폰', 1, 1),
    ('노트북', 1, 1),
    ('상의', 2, 1),
    ('하의', 2, 1),
    ('과일', 3, 1);

-- 제품 추가
-- 전자제품 > 스마트폰
INSERT INTO
    product (name, category_id)
VALUES ('갤럭시 S21', 6),
    ('아이폰 12', 6),
    ('픽셀 5', 6),
    ('원플러스 9', 6),
    ('샤오미 Mi 11', 6),
    ('LG 벨벳', 6),
    ('소니 엑스페리아 1 III', 6),
    ('모토로라 엣지', 6),
    ('화웨이 P40 Pro', 6),
    ('아수스 ROG Phone 5', 6);

-- 전자제품 > 노트북
INSERT INTO
    product (name, category_id)
VALUES ('맥북 프로', 7),
    ('델 XPS', 7),
    ('레노버 ThinkPad', 7),
    ('HP 스펙터', 7),
    ('에이서 프레데터', 7),
    ('ASUS ROG Zephyrus', 7),
    ('MSI GS66 Stealth', 7),
    ('LG 그램', 7),
    ('삼성 갤럭시북', 7),
    ('마이크로소프트 서피스 랩탑', 7);

-- 의류 > 상의
INSERT INTO
    product (name, category_id)
VALUES ('나이키 드라이핏 티셔츠', 8),
    ('아디다스 트레이닝 자켓', 8),
    ('유니클로 옥스포드 셔츠', 8),
    ('폴로 랄프로렌 폴로 셔츠', 8),
    ('노스페이스 플리스 자켓', 8),
    ('컨버스 후드티', 8),
    ('라코스테 스웨터', 8),
    ('리바이스 데님 자켓', 8),
    ('갭 맨투맨', 8),
    ('타미힐피거 니트', 8);

-- 의류 > 하의
INSERT INTO
    product (name, category_id)
VALUES ('리바이스 501 청바지', 9),
    ('나이키 조거 팬츠', 9),
    ('아디다스 트레이닝 팬츠', 9),
    ('유니클로 치노 팬츠', 9),
    ('자라 슬랙스', 9),
    ('H&M 카고 팬츠', 9),
    ('갭 코튼 쇼츠', 9),
    ('디키즈 워크 팬츠', 9),
    ('뉴발란스 스웻 팬츠', 9),
    ('언더아머 컴프레션 타이츠', 9);

-- 식품 > 과일
INSERT INTO
    product (name, category_id)
VALUES ('제주 감귤', 10),
    ('청송 사과', 10),
    ('나주 배', 10),
    ('성주 참외', 10),
    ('해남 수박', 10),
    ('영동 포도', 10),
    ('담양 딸기', 10),
    ('무주 천마', 10),
    ('양양 송이버섯', 10),
    ('제주 한라봉', 10);